test/fixtures/cassettes/signup_for_paid_offer.json

[
  {
    "request": {
      "body": "",
      "headers": {
        "Authorization": "Bearer sk_test_xgwHvfr4GBgJ9wrUDHoa1E57",
        "Content-Type": "application/x-www-form-urlencoded",
        "Stripe-Version": "2017-06-05"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.stripe.com/v1/charges?amount=5700&currency=hkd&description=Subcription+fee+for+swcc-0+via+Bravera.co&expand%5B%5D=balance_transaction&receipt_email=sherief%40plangora.com&source=tok_1ElwBZEXtHU8QBy8ZPONLVaF"
    },
    "response": {
      "binary": false,
      "body": "{\n  \"id\": \"ch_1ElwJEEXtHU8QBy8s6bGByVK\",\n  \"object\": \"charge\",\n  \"amount\": 5700,\n  \"amount_refunded\": 0,\n  \"application\": null,\n  \"application_fee\": null,\n  \"application_fee_amount\": null,\n  \"balance_transaction\": {\n    \"id\": \"txn_1ElwJFEXtHU8QBy8inTbuuFD\",\n    \"object\": \"balance_transaction\",\n    \"amount\": 5700,\n    \"available_on\": 1561248000,\n    \"created\": 1560683644,\n    \"currency\": \"hkd\",\n    \"description\": \"Subcription fee for swcc-0 via Bravera.co\",\n    \"exchange_rate\": null,\n    \"fee\": 429,\n    \"fee_details\": [\n      {\n        \"amount\": 429,\n        \"application\": null,\n        \"currency\": \"hkd\",\n        \"description\": \"Stripe processing fees\",\n        \"type\": \"stripe_fee\"\n      }\n    ],\n    \"net\": 5271,\n    \"source\": \"ch_1ElwJEEXtHU8QBy8s6bGByVK\",\n    \"status\": \"pending\",\n    \"type\": \"charge\"\n  },\n  \"billing_details\": {\n    \"address\": {\n      \"city\": null,\n      \"country\": null,\n      \"line1\": null,\n      \"line2\": null,\n      \"postal_code\": \"42424\",\n      \"state\": null\n    },\n    \"email\": null,\n    \"name\": null,\n    \"phone\": null\n  },\n  \"captured\": true,\n  \"created\": 1560683644,\n  \"currency\": \"hkd\",\n  \"customer\": null,\n  \"description\": \"Subcription fee for swcc-0 via Bravera.co\",\n  \"destination\": null,\n  \"dispute\": null,\n  \"failure_code\": null,\n  \"failure_message\": null,\n  \"fraud_details\": {\n  },\n  \"invoice\": null,\n  \"livemode\": false,\n  \"metadata\": {\n  },\n  \"on_behalf_of\": null,\n  \"order\": null,\n  \"outcome\": {\n    \"network_status\": \"approved_by_network\",\n    \"reason\": null,\n    \"risk_level\": \"normal\",\n    \"risk_score\": 33,\n    \"seller_message\": \"Payment complete.\",\n    \"type\": \"authorized\"\n  },\n  \"paid\": true,\n  \"payment_intent\": null,\n  \"payment_method\": \"card_1ElwBZEXtHU8QBy8yRpwDm5J\",\n  \"payment_method_details\": {\n    \"card\": {\n      \"brand\": \"visa\",\n      \"checks\": {\n        \"address_line1_check\": null,\n        \"address_postal_code_check\": \"pass\",\n        \"cvc_check\": \"pass\"\n      },\n      \"country\": \"US\",\n      \"exp_month\": 4,\n      \"exp_year\": 2024,\n      \"fingerprint\": \"FRWKuQtLcmN1ei2N\",\n      \"funding\": \"credit\",\n      \"last4\": \"4242\",\n      \"three_d_secure\": null,\n      \"wallet\": null\n    },\n    \"type\": \"card\"\n  },\n  \"receipt_email\": \"sherief@plangora.com\",\n  \"receipt_number\": null,\n  \"receipt_url\": \"https://pay.stripe.com/receipts/acct_1D6a9kEXtHU8QBy8/ch_1ElwJEEXtHU8QBy8s6bGByVK/rcpt_FGTFKMCmjl35hRPDWL3lIUIc2jEv16K\",\n  \"refunded\": false,\n  \"refunds\": {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/charges/ch_1ElwJEEXtHU8QBy8s6bGByVK/refunds\"\n  },\n  \"review\": null,\n  \"shipping\": null,\n  \"source\": {\n    \"id\": \"card_1ElwBZEXtHU8QBy8yRpwDm5J\",\n    \"object\": \"card\",\n    \"address_city\": null,\n    \"address_country\": null,\n    \"address_line1\": null,\n    \"address_line1_check\": null,\n    \"address_line2\": null,\n    \"address_state\": null,\n    \"address_zip\": \"42424\",\n    \"address_zip_check\": \"pass\",\n    \"brand\": \"Visa\",\n    \"country\": \"US\",\n    \"customer\": null,\n    \"cvc_check\": \"pass\",\n    \"dynamic_last4\": null,\n    \"exp_month\": 4,\n    \"exp_year\": 2024,\n    \"fingerprint\": \"FRWKuQtLcmN1ei2N\",\n    \"funding\": \"credit\",\n    \"last4\": \"4242\",\n    \"metadata\": {\n    },\n    \"name\": null,\n    \"tokenization_method\": null\n  },\n  \"source_transfer\": null,\n  \"statement_descriptor\": null,\n  \"status\": \"succeeded\",\n  \"transfer_data\": null,\n  \"transfer_group\": null\n}\n",
      "headers": {
        "Server": "nginx",
        "Date": "Sun, 16 Jun 2019 11:14:05 GMT",
        "Content-Type": "application/json",
        "Content-Length": "3378",
        "Connection": "keep-alive",
        "access-control-allow-credentials": "true",
        "access-control-allow-methods": "GET, POST, HEAD, OPTIONS, DELETE",
        "access-control-allow-origin": "*",
        "access-control-expose-headers": "Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required",
        "access-control-max-age": "300",
        "cache-control": "no-cache, no-store",
        "request-id": "req_7AkzBnWEWmynM2",
        "stripe-version": "2017-06-05",
        "Strict-Transport-Security": "max-age=31556926; includeSubDomains; preload"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]